SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_rac.h
/* Bit fields for RAC IFADCSTATUS */
#define _RAC_IFADCSTATUS_RESETVALUE                                   0x00000000UL                                  /**< Default value for RAC_IFADCSTATUS           */
#define _RAC_IFADCSTATUS_MASK                                         0x00000001UL                                  /**< Mask for RAC_IFADCSTATUS                    */
#define RAC_IFADCSTATUS_IFADCRCCALOUT                                 (0x1UL << 0)                                  /**< IFADCRCCALOUT                               */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_SHIFT                          0                                             /**< Shift value for RAC_IFADCRCCALOUT           */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_MASK                           0x1UL                                         /**< Bit mask for RAC_IFADCRCCALOUT              */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_DEFAULT                        0x00000000UL                                  /**< Mode DEFAULT for RAC_IFADCSTATUS            */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_lo                             0x00000000UL                                  /**< Mode lo for RAC_IFADCSTATUS                 */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_hi                             0x00000001UL                                  /**< Mode hi for RAC_IFADCSTATUS                 */
#define RAC_IFADCSTATUS_IFADCRCCALOUT_DEFAULT                         (_RAC_IFADCSTATUS_IFADCRCCALOUT_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_IFADCSTATUS    */
#define RAC_IFADCSTATUS_IFADCRCCALOUT_lo                              (_RAC_IFADCSTATUS_IFADCRCCALOUT_lo << 0)      /**< Shifted mode lo for RAC_IFADCSTATUS         */
#define RAC_IFADCSTATUS_IFADCRCCALOUT_hi                              (_RAC_IFADCSTATUS_IFADCRCCALOUT_hi << 0)      /**< Shifted mode hi for RAC_IFADCSTATUS         */

/* Bit fields for RAC LNAMIXTRIM0 */
#define _RAC_LNAMIXTRIM0_RESETVALUE                                   0x00000110UL                                     /**< Default value for RAC_LNAMIXTRIM0           */
#define _RAC_LNAMIXTRIM0_MASK                                         0x000001FFUL                                     /**< Mask for RAC_LNAMIXTRIM0                    */
#define _RAC_LNAMIXTRIM0_LNAMIXLNA0CAPSEL_SHIFT                       0                                                /**< Shift value for RAC_LNAMIXLNA0CAPSEL        */
#define _RAC_LNAMIXTRIM0_LNAMIXLNA0CAPSEL_MASK                        0x7UL                                            /**< Bit mask for RAC_LNAMIXLNA0CAPSEL           */
#define _RAC_LNAMIXTRIM0_LNAMIXLNA0CAPSEL_DEFAULT                     0x00000000UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define RAC_LNAMIXTRIM0_LNAMIXLNA0CAPSEL_DEFAULT                      (_RAC_LNAMIXTRIM0_LNAMIXLNA0CAPSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */
#define _RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_SHIFT                         3                                                /**< Shift value for RAC_LNAMIXMXRBIAS0          */
#define _RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_MASK                          0x18UL                                           /**< Bit mask for RAC_LNAMIXMXRBIAS0             */
#define _RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_DEFAULT                       0x00000002UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define _RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_1V                       0x00000000UL                                     /**< Mode bias_1V for RAC_LNAMIXTRIM0            */
#define _RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_unused                        0x00000001UL                                     /**< Mode unused for RAC_LNAMIXTRIM0             */
#define _RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_900m                     0x00000002UL                                     /**< Mode bias_900m for RAC_LNAMIXTRIM0          */
#define _RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_800m                     0x00000003UL                                     /**< Mode bias_800m for RAC_LNAMIXTRIM0          */
#define RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_DEFAULT                        (_RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_DEFAULT << 3)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */
#define RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_1V                        (_RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_1V << 3)   /**< Shifted mode bias_1V for RAC_LNAMIXTRIM0    */
#define RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_unused                         (_RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_unused << 3)    /**< Shifted mode unused for RAC_LNAMIXTRIM0     */
#define RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_900m                      (_RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_900m << 3) /**< Shifted mode bias_900m for RAC_LNAMIXTRIM0  */
#define RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_800m                      (_RAC_LNAMIXTRIM0_LNAMIXMXRBIAS0_bias_800m << 3) /**< Shifted mode bias_800m for RAC_LNAMIXTRIM0  */
#define _RAC_LNAMIXTRIM0_LNAMIXVOUT0ADJ_SHIFT                         5                                                /**< Shift value for RAC_LNAMIXVOUT0ADJ          */
#define _RAC_LNAMIXTRIM0_LNAMIXVOUT0ADJ_MASK                          0x1E0UL                                          /**< Bit mask for RAC_LNAMIXVOUT0ADJ             */
#define _RAC_LNAMIXTRIM0_LNAMIXVOUT0ADJ_DEFAULT                       0x00000008UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM0            */
#define RAC_LNAMIXTRIM0_LNAMIXVOUT0ADJ_DEFAULT                        (_RAC_LNAMIXTRIM0_LNAMIXVOUT0ADJ_DEFAULT << 5)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM0    */

/* Bit fields for RAC LNAMIXTRIM1 */
#define _RAC_LNAMIXTRIM1_RESETVALUE                                   0x00000110UL                                     /**< Default value for RAC_LNAMIXTRIM1           */
#define _RAC_LNAMIXTRIM1_MASK                                         0x000001FFUL                                     /**< Mask for RAC_LNAMIXTRIM1                    */
#define _RAC_LNAMIXTRIM1_LNAMIXLNA1CAPSEL_SHIFT                       0                                                /**< Shift value for RAC_LNAMIXLNA1CAPSEL        */
#define _RAC_LNAMIXTRIM1_LNAMIXLNA1CAPSEL_MASK                        0x7UL                                            /**< Bit mask for RAC_LNAMIXLNA1CAPSEL           */
#define _RAC_LNAMIXTRIM1_LNAMIXLNA1CAPSEL_DEFAULT                     0x00000000UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define RAC_LNAMIXTRIM1_LNAMIXLNA1CAPSEL_DEFAULT                      (_RAC_LNAMIXTRIM1_LNAMIXLNA1CAPSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_SHIFT                         3                                                /**< Shift value for RAC_LNAMIXMXRBIAS1          */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_MASK                          0x18UL                                           /**< Bit mask for RAC_LNAMIXMXRBIAS1             */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_DEFAULT                       0x00000002UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_1V                       0x00000000UL                                     /**< Mode bias_1V for RAC_LNAMIXTRIM1            */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_unused                        0x00000001UL                                     /**< Mode unused for RAC_LNAMIXTRIM1             */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_900m                     0x00000002UL                                     /**< Mode bias_900m for RAC_LNAMIXTRIM1          */
#define _RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_800m                     0x00000003UL                                     /**< Mode bias_800m for RAC_LNAMIXTRIM1          */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_DEFAULT                        (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_DEFAULT << 3)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_1V                        (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_1V << 3)   /**< Shifted mode bias_1V for RAC_LNAMIXTRIM1    */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_unused                         (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_unused << 3)    /**< Shifted mode unused for RAC_LNAMIXTRIM1     */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_900m                      (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_900m << 3) /**< Shifted mode bias_900m for RAC_LNAMIXTRIM1  */
#define RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_800m                      (_RAC_LNAMIXTRIM1_LNAMIXMXRBIAS1_bias_800m << 3) /**< Shifted mode bias_800m for RAC_LNAMIXTRIM1  */
#define _RAC_LNAMIXTRIM1_LNAMIXVOUT1ADJ_SHIFT                         5                                                /**< Shift value for RAC_LNAMIXVOUT1ADJ          */
#define _RAC_LNAMIXTRIM1_LNAMIXVOUT1ADJ_MASK                          0x1E0UL                                          /**< Bit mask for RAC_LNAMIXVOUT1ADJ             */
#define _RAC_LNAMIXTRIM1_LNAMIXVOUT1ADJ_DEFAULT                       0x00000008UL                                     /**< Mode DEFAULT for RAC_LNAMIXTRIM1            */
#define RAC_LNAMIXTRIM1_LNAMIXVOUT1ADJ_DEFAULT                        (_RAC_LNAMIXTRIM1_LNAMIXVOUT1ADJ_DEFAULT << 5)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM1    */

/* Bit fields for RAC LNAMIXTRIM2 */
#define _RAC_LNAMIXTRIM2_RESETVALUE                                   0x0115E3D0UL                                         /**< Default value for RAC_LNAMIXTRIM2           */
#define _RAC_LNAMIXTRIM2_MASK                                         0x01FFFFF0UL                                         /**< Mask for RAC_LNAMIXTRIM2                    */
#define _RAC_LNAMIXTRIM2_LNAMIXCURCTRL_SHIFT                          4                                                    /**< Shift value for RAC_LNAMIXCURCTRL           */
#define _RAC_LNAMIXTRIM2_LNAMIXCURCTRL_MASK                           0x3F0UL                                              /**< Bit mask for RAC_LNAMIXCURCTRL              */
#define _RAC_LNAMIXTRIM2_LNAMIXCURCTRL_DEFAULT                        0x0000003DUL                                         /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define RAC_LNAMIXTRIM2_LNAMIXCURCTRL_DEFAULT                         (_RAC_LNAMIXTRIM2_LNAMIXCURCTRL_DEFAULT << 4)        /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define _RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_SHIFT                          10                                                   /**< Shift value for RAC_LNAMIXHIGHCUR           */
#define _RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_MASK                           0xC00UL                                              /**< Bit mask for RAC_LNAMIXHIGHCUR              */
#define _RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_DEFAULT                        0x00000000UL                                         /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define _RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_470uA                  0x00000000UL                                         /**< Mode current_470uA for RAC_LNAMIXTRIM2      */
#define _RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_530uA                  0x00000001UL                                         /**< Mode current_530uA for RAC_LNAMIXTRIM2      */
#define _RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_unused                         0x00000002UL                                         /**< Mode unused for RAC_LNAMIXTRIM2             */
#define _RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_590uA                  0x00000003UL                                         /**< Mode current_590uA for RAC_LNAMIXTRIM2      */
#define RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_DEFAULT                         (_RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_DEFAULT << 10)       /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_470uA                   (_RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_470uA << 10) /**< Shifted mode current_470uA for RAC_LNAMIXTRIM2*/
#define RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_530uA                   (_RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_530uA << 10) /**< Shifted mode current_530uA for RAC_LNAMIXTRIM2*/
#define RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_unused                          (_RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_unused << 10)        /**< Shifted mode unused for RAC_LNAMIXTRIM2     */
#define RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_590uA                   (_RAC_LNAMIXTRIM2_LNAMIXHIGHCUR_current_590uA << 10) /**< Shifted mode current_590uA for RAC_LNAMIXTRIM2*/
#define _RAC_LNAMIXTRIM2_LNAMIXLOWCUR_SHIFT                           12                                                   /**< Shift value for RAC_LNAMIXLOWCUR            */
#define _RAC_LNAMIXTRIM2_LNAMIXLOWCUR_MASK                            0x3000UL                                             /**< Bit mask for RAC_LNAMIXLOWCUR               */
#define _RAC_LNAMIXTRIM2_LNAMIXLOWCUR_DEFAULT                         0x00000002UL                                         /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define _RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_60per                   0x00000000UL                                         /**< Mode current_60per for RAC_LNAMIXTRIM2      */
#define _RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_80per                   0x00000001UL                                         /**< Mode current_80per for RAC_LNAMIXTRIM2      */
#define _RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_100per                  0x00000002UL                                         /**< Mode current_100per for RAC_LNAMIXTRIM2     */
#define _RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_150per                  0x00000003UL                                         /**< Mode current_150per for RAC_LNAMIXTRIM2     */
#define RAC_LNAMIXTRIM2_LNAMIXLOWCUR_DEFAULT                          (_RAC_LNAMIXTRIM2_LNAMIXLOWCUR_DEFAULT << 12)        /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_60per                    (_RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_60per << 12)  /**< Shifted mode current_60per for RAC_LNAMIXTRIM2*/
#define RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_80per                    (_RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_80per << 12)  /**< Shifted mode current_80per for RAC_LNAMIXTRIM2*/
#define RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_100per                   (_RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_100per << 12) /**< Shifted mode current_100per for RAC_LNAMIXTRIM2*/
#define RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_150per                   (_RAC_LNAMIXTRIM2_LNAMIXLOWCUR_current_150per << 12) /**< Shifted mode current_150per for RAC_LNAMIXTRIM2*/
#define _RAC_LNAMIXTRIM2_LNAMIXLNARESADJ_SHIFT                        14                                                   /**< Shift value for RAC_LNAMIXLNARESADJ         */
#define _RAC_LNAMIXTRIM2_LNAMIXLNARESADJ_MASK                         0x1C000UL                                            /**< Bit mask for RAC_LNAMIXLNARESADJ            */
#define _RAC_LNAMIXTRIM2_LNAMIXLNARESADJ_DEFAULT                      0x00000007UL                                         /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define RAC_LNAMIXTRIM2_LNAMIXLNARESADJ_DEFAULT                       (_RAC_LNAMIXTRIM2_LNAMIXLNARESADJ_DEFAULT << 14)     /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define _RAC_LNAMIXTRIM2_LNAMIXNCASADJ_SHIFT                          17                                                   /**< Shift value for RAC_LNAMIXNCASADJ           */
#define _RAC_LNAMIXTRIM2_LNAMIXNCASADJ_MASK                           0x60000UL                                            /**< Bit mask for RAC_LNAMIXNCASADJ              */
#define _RAC_LNAMIXTRIM2_LNAMIXNCASADJ_DEFAULT                        0x00000002UL                                         /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define RAC_LNAMIXTRIM2_LNAMIXNCASADJ_DEFAULT                         (_RAC_LNAMIXTRIM2_LNAMIXNCASADJ_DEFAULT << 17)       /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define _RAC_LNAMIXTRIM2_LNAMIXPCASADJ_SHIFT                          19                                                   /**< Shift value for RAC_LNAMIXPCASADJ           */
#define _RAC_LNAMIXTRIM2_LNAMIXPCASADJ_MASK                           0x180000UL                                           /**< Bit mask for RAC_LNAMIXPCASADJ              */
#define _RAC_LNAMIXTRIM2_LNAMIXPCASADJ_DEFAULT                        0x00000002UL                                         /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define RAC_LNAMIXTRIM2_LNAMIXPCASADJ_DEFAULT                         (_RAC_LNAMIXTRIM2_LNAMIXPCASADJ_DEFAULT << 19)       /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define _RAC_LNAMIXTRIM2_LNAMIXTRIMVREG_SHIFT                         21                                                   /**< Shift value for RAC_LNAMIXTRIMVREG          */
#define _RAC_LNAMIXTRIM2_LNAMIXTRIMVREG_MASK                          0x1E00000UL                                          /**< Bit mask for RAC_LNAMIXTRIMVREG             */
#define _RAC_LNAMIXTRIM2_LNAMIXTRIMVREG_DEFAULT                       0x00000008UL                                         /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define RAC_LNAMIXTRIM2_LNAMIXTRIMVREG_DEFAULT                        (_RAC_LNAMIXTRIM2_LNAMIXTRIMVREG_DEFAULT << 21)      /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */

/* Bit fields for RAC LNAMIXTRIM3 */
#define _RAC_LNAMIXTRIM3_RESETVALUE                                   0x00002A10UL                                                   /**< Default value for RAC_LNAMIXTRIM3           */
#define _RAC_LNAMIXTRIM3_MASK                                         0x00003FFFUL                                                   /**< Mask for RAC_LNAMIXTRIM3                    */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASADJN_SHIFT                        0                                                              /**< Shift value for RAC_LNAMIXIBIASADJN         */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASADJN_MASK                         0x1FUL                                                         /**< Bit mask for RAC_LNAMIXIBIASADJN            */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASADJN_DEFAULT                      0x00000010UL                                                   /**< Mode DEFAULT for RAC_LNAMIXTRIM3            */
#define RAC_LNAMIXTRIM3_LNAMIXIBIASADJN_DEFAULT                       (_RAC_LNAMIXTRIM3_LNAMIXIBIASADJN_DEFAULT << 0)                /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM3    */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASADJP_SHIFT                        5                                                              /**< Shift value for RAC_LNAMIXIBIASADJP         */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASADJP_MASK                         0x3E0UL                                                        /**< Bit mask for RAC_LNAMIXIBIASADJP            */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASADJP_DEFAULT                      0x00000010UL                                                   /**< Mode DEFAULT for RAC_LNAMIXTRIM3            */
#define RAC_LNAMIXTRIM3_LNAMIXIBIASADJP_DEFAULT                       (_RAC_LNAMIXTRIM3_LNAMIXIBIASADJP_DEFAULT << 5)                /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM3    */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_SHIFT                   10                                                             /**< Shift value for RAC_LNAMIXIBIASRANGEADJN    */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_MASK                    0xC00UL                                                        /**< Bit mask for RAC_LNAMIXIBIASRANGEADJN       */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_DEFAULT                 0x00000002UL                                                   /**< Mode DEFAULT for RAC_LNAMIXTRIM3            */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_Shift_range_low         0x00000000UL                                                   /**< Mode Shift_range_low for RAC_LNAMIXTRIM3    */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_default                 0x00000002UL                                                   /**< Mode default for RAC_LNAMIXTRIM3            */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_Shift_range_high        0x00000003UL                                                   /**< Mode Shift_range_high for RAC_LNAMIXTRIM3   */
#define RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_DEFAULT                  (_RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_DEFAULT << 10)          /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM3    */
#define RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_Shift_range_low          (_RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_Shift_range_low << 10)  /**< Shifted mode Shift_range_low for RAC_LNAMIXTRIM3*/
#define RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_default                  (_RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_default << 10)          /**< Shifted mode default for RAC_LNAMIXTRIM3    */
#define RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_Shift_range_high         (_RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJN_Shift_range_high << 10) /**< Shifted mode Shift_range_high for RAC_LNAMIXTRIM3*/
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_SHIFT                   12                                                             /**< Shift value for RAC_LNAMIXIBIASRANGEADJP    */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_MASK                    0x3000UL                                                       /**< Bit mask for RAC_LNAMIXIBIASRANGEADJP       */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_DEFAULT                 0x00000002UL                                                   /**< Mode DEFAULT for RAC_LNAMIXTRIM3            */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_Shift_range_low         0x00000000UL                                                   /**< Mode Shift_range_low for RAC_LNAMIXTRIM3    */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_default                 0x00000002UL                                                   /**< Mode default for RAC_LNAMIXTRIM3            */
#define _RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_Shift_range_high        0x00000003UL                                                   /**< Mode Shift_range_high for RAC_LNAMIXTRIM3   */
#define RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_DEFAULT                  (_RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_DEFAULT << 12)          /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM3    */
#define RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_Shift_range_low          (_RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_Shift_range_low << 12)  /**< Shifted mode Shift_range_low for RAC_LNAMIXTRIM3*/
#define RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_default                  (_RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_default << 12)          /**< Shifted mode default for RAC_LNAMIXTRIM3    */
#define RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_Shift_range_high         (_RAC_LNAMIXTRIM3_LNAMIXIBIASRANGEADJP_Shift_range_high << 12) /**< Shifted mode Shift_range_high for RAC_LNAMIXTRIM3*/

