SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_rac.h
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0136ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0136ps << 12)   /**< Shifted mode tnov_0136ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0149ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0149ps << 12)   /**< Shifted mode tnov_0149ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0164ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0164ps << 12)   /**< Shifted mode tnov_0164ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0181ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0181ps << 12)   /**< Shifted mode tnov_0181ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0203ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0203ps << 12)   /**< Shifted mode tnov_0203ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0230ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0230ps << 12)   /**< Shifted mode tnov_0230ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0262ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0262ps << 12)   /**< Shifted mode tnov_0262ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0353ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0353ps << 12)   /**< Shifted mode tnov_0353ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0495ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0495ps << 12)   /**< Shifted mode tnov_0495ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0723ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0723ps << 12)   /**< Shifted mode tnov_0723ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_1099ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_1099ps << 12)   /**< Shifted mode tnov_1099ps for RAC_PATRIM2    */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_SHIFT                            16                                                     /**< Shift value for RAC_TXTRIMDRVEDGENN         */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_MASK                             0xF0000UL                                              /**< Bit mask for RAC_TXTRIMDRVEDGENN            */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_DEFAULT                          0x00000000UL                                           /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0103ps                     0x00000000UL                                           /**< Mode tedge_0103ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0110ps                     0x00000001UL                                           /**< Mode tedge_0110ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0118ps                     0x00000002UL                                           /**< Mode tedge_0118ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0125ps                     0x00000003UL                                           /**< Mode tedge_0125ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0137ps                     0x00000004UL                                           /**< Mode tedge_0137ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0159ps                     0x00000005UL                                           /**< Mode tedge_0159ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0178ps                     0x00000006UL                                           /**< Mode tedge_0178ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0203ps                     0x00000007UL                                           /**< Mode tedge_0203ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0238ps                     0x00000008UL                                           /**< Mode tedge_0238ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0288ps                     0x00000009UL                                           /**< Mode tedge_0288ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0357ps                     0x0000000AUL                                           /**< Mode tedge_0357ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0457ps                     0x0000000BUL                                           /**< Mode tedge_0457ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0604ps                     0x0000000CUL                                           /**< Mode tedge_0604ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0828ps                     0x0000000DUL                                           /**< Mode tedge_0828ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_1186ps                     0x0000000EUL                                           /**< Mode tedge_1186ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_1793ps                     0x0000000FUL                                           /**< Mode tedge_1793ps for RAC_PATRIM2           */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_DEFAULT                           (_RAC_PATRIM2_TXTRIMDRVEDGENN_DEFAULT << 16)           /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0103ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0103ps << 16)      /**< Shifted mode tedge_0103ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0110ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0110ps << 16)      /**< Shifted mode tedge_0110ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0118ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0118ps << 16)      /**< Shifted mode tedge_0118ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0125ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0125ps << 16)      /**< Shifted mode tedge_0125ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0137ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0137ps << 16)      /**< Shifted mode tedge_0137ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0159ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0159ps << 16)      /**< Shifted mode tedge_0159ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0178ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0178ps << 16)      /**< Shifted mode tedge_0178ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0203ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0203ps << 16)      /**< Shifted mode tedge_0203ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0238ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0238ps << 16)      /**< Shifted mode tedge_0238ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0288ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0288ps << 16)      /**< Shifted mode tedge_0288ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0357ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0357ps << 16)      /**< Shifted mode tedge_0357ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0457ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0457ps << 16)      /**< Shifted mode tedge_0457ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0604ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0604ps << 16)      /**< Shifted mode tedge_0604ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0828ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_0828ps << 16)      /**< Shifted mode tedge_0828ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_1186ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_1186ps << 16)      /**< Shifted mode tedge_1186ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_1793ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENN_tedge_1793ps << 16)      /**< Shifted mode tedge_1793ps for RAC_PATRIM2   */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_SHIFT                            20                                                     /**< Shift value for RAC_TXTRIMDRVEDGENP         */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_MASK                             0xF00000UL                                             /**< Bit mask for RAC_TXTRIMDRVEDGENP            */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_DEFAULT                          0x00000000UL                                           /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0103ps                     0x00000000UL                                           /**< Mode tedge_0103ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0110ps                     0x00000001UL                                           /**< Mode tedge_0110ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0118ps                     0x00000002UL                                           /**< Mode tedge_0118ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0125ps                     0x00000003UL                                           /**< Mode tedge_0125ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0137ps                     0x00000004UL                                           /**< Mode tedge_0137ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0159ps                     0x00000005UL                                           /**< Mode tedge_0159ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0178ps                     0x00000006UL                                           /**< Mode tedge_0178ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0203ps                     0x00000007UL                                           /**< Mode tedge_0203ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0238ps                     0x00000008UL                                           /**< Mode tedge_0238ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0288ps                     0x00000009UL                                           /**< Mode tedge_0288ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0357ps                     0x0000000AUL                                           /**< Mode tedge_0357ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0457ps                     0x0000000BUL                                           /**< Mode tedge_0457ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0604ps                     0x0000000CUL                                           /**< Mode tedge_0604ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0828ps                     0x0000000DUL                                           /**< Mode tedge_0828ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_1186ps                     0x0000000EUL                                           /**< Mode tedge_1186ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_1793ps                     0x0000000FUL                                           /**< Mode tedge_1793ps for RAC_PATRIM2           */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_DEFAULT                           (_RAC_PATRIM2_TXTRIMDRVEDGENP_DEFAULT << 20)           /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0103ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0103ps << 20)      /**< Shifted mode tedge_0103ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0110ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0110ps << 20)      /**< Shifted mode tedge_0110ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0118ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0118ps << 20)      /**< Shifted mode tedge_0118ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0125ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0125ps << 20)      /**< Shifted mode tedge_0125ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0137ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0137ps << 20)      /**< Shifted mode tedge_0137ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0159ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0159ps << 20)      /**< Shifted mode tedge_0159ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0178ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0178ps << 20)      /**< Shifted mode tedge_0178ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0203ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0203ps << 20)      /**< Shifted mode tedge_0203ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0238ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0238ps << 20)      /**< Shifted mode tedge_0238ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0288ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0288ps << 20)      /**< Shifted mode tedge_0288ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0357ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0357ps << 20)      /**< Shifted mode tedge_0357ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0457ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0457ps << 20)      /**< Shifted mode tedge_0457ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0604ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0604ps << 20)      /**< Shifted mode tedge_0604ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0828ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_0828ps << 20)      /**< Shifted mode tedge_0828ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_1186ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_1186ps << 20)      /**< Shifted mode tedge_1186ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_1793ps                      (_RAC_PATRIM2_TXTRIMDRVEDGENP_tedge_1793ps << 20)      /**< Shifted mode tedge_1793ps for RAC_PATRIM2   */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_SHIFT                            24                                                     /**< Shift value for RAC_TXTRIMDRVEDGEPN         */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_MASK                             0xF000000UL                                            /**< Bit mask for RAC_TXTRIMDRVEDGEPN            */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_DEFAULT                          0x00000000UL                                           /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0103ps                     0x00000000UL                                           /**< Mode tedge_0103ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0110ps                     0x00000001UL                                           /**< Mode tedge_0110ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0118ps                     0x00000002UL                                           /**< Mode tedge_0118ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0125ps                     0x00000003UL                                           /**< Mode tedge_0125ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0137ps                     0x00000004UL                                           /**< Mode tedge_0137ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0159ps                     0x00000005UL                                           /**< Mode tedge_0159ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0178ps                     0x00000006UL                                           /**< Mode tedge_0178ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0203ps                     0x00000007UL                                           /**< Mode tedge_0203ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0238ps                     0x00000008UL                                           /**< Mode tedge_0238ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0288ps                     0x00000009UL                                           /**< Mode tedge_0288ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0357ps                     0x0000000AUL                                           /**< Mode tedge_0357ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0457ps                     0x0000000BUL                                           /**< Mode tedge_0457ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0604ps                     0x0000000CUL                                           /**< Mode tedge_0604ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0828ps                     0x0000000DUL                                           /**< Mode tedge_0828ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_1186ps                     0x0000000EUL                                           /**< Mode tedge_1186ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_1793ps                     0x0000000FUL                                           /**< Mode tedge_1793ps for RAC_PATRIM2           */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_DEFAULT                           (_RAC_PATRIM2_TXTRIMDRVEDGEPN_DEFAULT << 24)           /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0103ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0103ps << 24)      /**< Shifted mode tedge_0103ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0110ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0110ps << 24)      /**< Shifted mode tedge_0110ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0118ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0118ps << 24)      /**< Shifted mode tedge_0118ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0125ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0125ps << 24)      /**< Shifted mode tedge_0125ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0137ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0137ps << 24)      /**< Shifted mode tedge_0137ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0159ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0159ps << 24)      /**< Shifted mode tedge_0159ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0178ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0178ps << 24)      /**< Shifted mode tedge_0178ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0203ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0203ps << 24)      /**< Shifted mode tedge_0203ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0238ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0238ps << 24)      /**< Shifted mode tedge_0238ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0288ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0288ps << 24)      /**< Shifted mode tedge_0288ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0357ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0357ps << 24)      /**< Shifted mode tedge_0357ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0457ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0457ps << 24)      /**< Shifted mode tedge_0457ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0604ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0604ps << 24)      /**< Shifted mode tedge_0604ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0828ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_0828ps << 24)      /**< Shifted mode tedge_0828ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_1186ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_1186ps << 24)      /**< Shifted mode tedge_1186ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_1793ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPN_tedge_1793ps << 24)      /**< Shifted mode tedge_1793ps for RAC_PATRIM2   */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_SHIFT                            28                                                     /**< Shift value for RAC_TXTRIMDRVEDGEPP         */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_MASK                             0xF0000000UL                                           /**< Bit mask for RAC_TXTRIMDRVEDGEPP            */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_DEFAULT                          0x00000000UL                                           /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0103ps                     0x00000000UL                                           /**< Mode tedge_0103ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0110ps                     0x00000001UL                                           /**< Mode tedge_0110ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0118ps                     0x00000002UL                                           /**< Mode tedge_0118ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0125ps                     0x00000003UL                                           /**< Mode tedge_0125ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0137ps                     0x00000004UL                                           /**< Mode tedge_0137ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0159ps                     0x00000005UL                                           /**< Mode tedge_0159ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0179ps                     0x00000006UL                                           /**< Mode tedge_0179ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0203ps                     0x00000007UL                                           /**< Mode tedge_0203ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0238ps                     0x00000008UL                                           /**< Mode tedge_0238ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0288ps                     0x00000009UL                                           /**< Mode tedge_0288ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0357ps                     0x0000000AUL                                           /**< Mode tedge_0357ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0457ps                     0x0000000BUL                                           /**< Mode tedge_0457ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0604ps                     0x0000000CUL                                           /**< Mode tedge_0604ps for RAC_PATRIM2           */
