SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_rac.h
#define _RAC_PATRIM3_TXTRIMOREG_v1p806                                0x0000000EUL                                                 /**< Mode v1p806 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p833                                0x0000000FUL                                                 /**< Mode v1p833 for RAC_PATRIM3                 */
#define RAC_PATRIM3_TXTRIMOREG_DEFAULT                                (_RAC_PATRIM3_TXTRIMOREG_DEFAULT << 13)                      /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMOREG_v1p420                                 (_RAC_PATRIM3_TXTRIMOREG_v1p420 << 13)                       /**< Shifted mode v1p420 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p448                                 (_RAC_PATRIM3_TXTRIMOREG_v1p448 << 13)                       /**< Shifted mode v1p448 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p475                                 (_RAC_PATRIM3_TXTRIMOREG_v1p475 << 13)                       /**< Shifted mode v1p475 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p503                                 (_RAC_PATRIM3_TXTRIMOREG_v1p503 << 13)                       /**< Shifted mode v1p503 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p531                                 (_RAC_PATRIM3_TXTRIMOREG_v1p531 << 13)                       /**< Shifted mode v1p531 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p558                                 (_RAC_PATRIM3_TXTRIMOREG_v1p558 << 13)                       /**< Shifted mode v1p558 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p586                                 (_RAC_PATRIM3_TXTRIMOREG_v1p586 << 13)                       /**< Shifted mode v1p586 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p613                                 (_RAC_PATRIM3_TXTRIMOREG_v1p613 << 13)                       /**< Shifted mode v1p613 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p641                                 (_RAC_PATRIM3_TXTRIMOREG_v1p641 << 13)                       /**< Shifted mode v1p641 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p668                                 (_RAC_PATRIM3_TXTRIMOREG_v1p668 << 13)                       /**< Shifted mode v1p668 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p696                                 (_RAC_PATRIM3_TXTRIMOREG_v1p696 << 13)                       /**< Shifted mode v1p696 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p723                                 (_RAC_PATRIM3_TXTRIMOREG_v1p723 << 13)                       /**< Shifted mode v1p723 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p751                                 (_RAC_PATRIM3_TXTRIMOREG_v1p751 << 13)                       /**< Shifted mode v1p751 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p778                                 (_RAC_PATRIM3_TXTRIMOREG_v1p778 << 13)                       /**< Shifted mode v1p778 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p806                                 (_RAC_PATRIM3_TXTRIMOREG_v1p806 << 13)                       /**< Shifted mode v1p806 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREG_v1p833                                 (_RAC_PATRIM3_TXTRIMOREG_v1p833 << 13)                       /**< Shifted mode v1p833 for RAC_PATRIM3         */
#define _RAC_PATRIM3_TXTRIMRREG_SHIFT                                 17                                                           /**< Shift value for RAC_TXTRIMRREG              */
#define _RAC_PATRIM3_TXTRIMRREG_MASK                                  0x1E0000UL                                                   /**< Bit mask for RAC_TXTRIMRREG                 */
#define _RAC_PATRIM3_TXTRIMRREG_DEFAULT                               0x00000008UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMRREG_v1p354                                0x00000000UL                                                 /**< Mode v1p354 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p380                                0x00000001UL                                                 /**< Mode v1p380 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p406                                0x00000002UL                                                 /**< Mode v1p406 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p432                                0x00000003UL                                                 /**< Mode v1p432 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p458                                0x00000004UL                                                 /**< Mode v1p458 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p484                                0x00000005UL                                                 /**< Mode v1p484 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p510                                0x00000006UL                                                 /**< Mode v1p510 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p536                                0x00000007UL                                                 /**< Mode v1p536 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p562                                0x00000008UL                                                 /**< Mode v1p562 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p588                                0x00000009UL                                                 /**< Mode v1p588 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p614                                0x0000000AUL                                                 /**< Mode v1p614 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p640                                0x0000000BUL                                                 /**< Mode v1p640 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p666                                0x0000000CUL                                                 /**< Mode v1p666 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p692                                0x0000000DUL                                                 /**< Mode v1p692 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p707                                0x0000000EUL                                                 /**< Mode v1p707 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMRREG_v1p708                                0x0000000FUL                                                 /**< Mode v1p708 for RAC_PATRIM3                 */
#define RAC_PATRIM3_TXTRIMRREG_DEFAULT                                (_RAC_PATRIM3_TXTRIMRREG_DEFAULT << 17)                      /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMRREG_v1p354                                 (_RAC_PATRIM3_TXTRIMRREG_v1p354 << 17)                       /**< Shifted mode v1p354 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p380                                 (_RAC_PATRIM3_TXTRIMRREG_v1p380 << 17)                       /**< Shifted mode v1p380 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p406                                 (_RAC_PATRIM3_TXTRIMRREG_v1p406 << 17)                       /**< Shifted mode v1p406 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p432                                 (_RAC_PATRIM3_TXTRIMRREG_v1p432 << 17)                       /**< Shifted mode v1p432 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p458                                 (_RAC_PATRIM3_TXTRIMRREG_v1p458 << 17)                       /**< Shifted mode v1p458 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p484                                 (_RAC_PATRIM3_TXTRIMRREG_v1p484 << 17)                       /**< Shifted mode v1p484 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p510                                 (_RAC_PATRIM3_TXTRIMRREG_v1p510 << 17)                       /**< Shifted mode v1p510 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p536                                 (_RAC_PATRIM3_TXTRIMRREG_v1p536 << 17)                       /**< Shifted mode v1p536 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p562                                 (_RAC_PATRIM3_TXTRIMRREG_v1p562 << 17)                       /**< Shifted mode v1p562 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p588                                 (_RAC_PATRIM3_TXTRIMRREG_v1p588 << 17)                       /**< Shifted mode v1p588 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p614                                 (_RAC_PATRIM3_TXTRIMRREG_v1p614 << 17)                       /**< Shifted mode v1p614 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p640                                 (_RAC_PATRIM3_TXTRIMRREG_v1p640 << 17)                       /**< Shifted mode v1p640 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p666                                 (_RAC_PATRIM3_TXTRIMRREG_v1p666 << 17)                       /**< Shifted mode v1p666 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p692                                 (_RAC_PATRIM3_TXTRIMRREG_v1p692 << 17)                       /**< Shifted mode v1p692 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p707                                 (_RAC_PATRIM3_TXTRIMRREG_v1p707 << 17)                       /**< Shifted mode v1p707 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMRREG_v1p708                                 (_RAC_PATRIM3_TXTRIMRREG_v1p708 << 17)                       /**< Shifted mode v1p708 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREGPSR                                     (0x1UL << 21)                                                /**< TXTRIMDREGPSR                               */
#define _RAC_PATRIM3_TXTRIMDREGPSR_SHIFT                              21                                                           /**< Shift value for RAC_TXTRIMDREGPSR           */
#define _RAC_PATRIM3_TXTRIMDREGPSR_MASK                               0x200000UL                                                   /**< Bit mask for RAC_TXTRIMDREGPSR              */
#define _RAC_PATRIM3_TXTRIMDREGPSR_DEFAULT                            0x00000000UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMDREGPSR_disable_psrr_boost                 0x00000000UL                                                 /**< Mode disable_psrr_boost for RAC_PATRIM3     */
#define _RAC_PATRIM3_TXTRIMDREGPSR_enable_psrr_boost                  0x00000001UL                                                 /**< Mode enable_psrr_boost for RAC_PATRIM3      */
#define RAC_PATRIM3_TXTRIMDREGPSR_DEFAULT                             (_RAC_PATRIM3_TXTRIMDREGPSR_DEFAULT << 21)                   /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREGPSR_disable_psrr_boost                  (_RAC_PATRIM3_TXTRIMDREGPSR_disable_psrr_boost << 21)        /**< Shifted mode disable_psrr_boost for RAC_PATRIM3*/
#define RAC_PATRIM3_TXTRIMDREGPSR_enable_psrr_boost                   (_RAC_PATRIM3_TXTRIMDREGPSR_enable_psrr_boost << 21)         /**< Shifted mode enable_psrr_boost for RAC_PATRIM3*/
#define RAC_PATRIM3_TXTRIMOREGPSR                                     (0x1UL << 22)                                                /**< TXTRIMOREGPSR                               */
#define _RAC_PATRIM3_TXTRIMOREGPSR_SHIFT                              22                                                           /**< Shift value for RAC_TXTRIMOREGPSR           */
#define _RAC_PATRIM3_TXTRIMOREGPSR_MASK                               0x400000UL                                                   /**< Bit mask for RAC_TXTRIMOREGPSR              */
#define _RAC_PATRIM3_TXTRIMOREGPSR_DEFAULT                            0x00000000UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMOREGPSR_disable_psrr_cancellation          0x00000000UL                                                 /**< Mode disable_psrr_cancellation for RAC_PATRIM3*/
#define _RAC_PATRIM3_TXTRIMOREGPSR_enable_psrr_cancellation           0x00000001UL                                                 /**< Mode enable_psrr_cancellation for RAC_PATRIM3*/
#define RAC_PATRIM3_TXTRIMOREGPSR_DEFAULT                             (_RAC_PATRIM3_TXTRIMOREGPSR_DEFAULT << 22)                   /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMOREGPSR_disable_psrr_cancellation           (_RAC_PATRIM3_TXTRIMOREGPSR_disable_psrr_cancellation << 22) /**< Shifted mode disable_psrr_cancellation for RAC_PATRIM3*/
#define RAC_PATRIM3_TXTRIMOREGPSR_enable_psrr_cancellation            (_RAC_PATRIM3_TXTRIMOREGPSR_enable_psrr_cancellation << 22)  /**< Shifted mode enable_psrr_cancellation for RAC_PATRIM3*/
#define _RAC_PATRIM3_TXTRIMDREGSLICES_SHIFT                           23                                                           /**< Shift value for RAC_TXTRIMDREGSLICES        */
#define _RAC_PATRIM3_TXTRIMDREGSLICES_MASK                            0x1800000UL                                                  /**< Bit mask for RAC_TXTRIMDREGSLICES           */
#define _RAC_PATRIM3_TXTRIMDREGSLICES_DEFAULT                         0x00000001UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMDREGSLICES_slice_1x                        0x00000000UL                                                 /**< Mode slice_1x for RAC_PATRIM3               */
#define _RAC_PATRIM3_TXTRIMDREGSLICES_slice_2x                        0x00000001UL                                                 /**< Mode slice_2x for RAC_PATRIM3               */
#define _RAC_PATRIM3_TXTRIMDREGSLICES_slice_3x                        0x00000002UL                                                 /**< Mode slice_3x for RAC_PATRIM3               */
#define _RAC_PATRIM3_TXTRIMDREGSLICES_slice_4x                        0x00000003UL                                                 /**< Mode slice_4x for RAC_PATRIM3               */
#define RAC_PATRIM3_TXTRIMDREGSLICES_DEFAULT                          (_RAC_PATRIM3_TXTRIMDREGSLICES_DEFAULT << 23)                /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREGSLICES_slice_1x                         (_RAC_PATRIM3_TXTRIMDREGSLICES_slice_1x << 23)               /**< Shifted mode slice_1x for RAC_PATRIM3       */
#define RAC_PATRIM3_TXTRIMDREGSLICES_slice_2x                         (_RAC_PATRIM3_TXTRIMDREGSLICES_slice_2x << 23)               /**< Shifted mode slice_2x for RAC_PATRIM3       */
#define RAC_PATRIM3_TXTRIMDREGSLICES_slice_3x                         (_RAC_PATRIM3_TXTRIMDREGSLICES_slice_3x << 23)               /**< Shifted mode slice_3x for RAC_PATRIM3       */
#define RAC_PATRIM3_TXTRIMDREGSLICES_slice_4x                         (_RAC_PATRIM3_TXTRIMDREGSLICES_slice_4x << 23)               /**< Shifted mode slice_4x for RAC_PATRIM3       */
#define _RAC_PATRIM3_TXTRIMOREGSLICES_SHIFT                           25                                                           /**< Shift value for RAC_TXTRIMOREGSLICES        */
#define _RAC_PATRIM3_TXTRIMOREGSLICES_MASK                            0x6000000UL                                                  /**< Bit mask for RAC_TXTRIMOREGSLICES           */
#define _RAC_PATRIM3_TXTRIMOREGSLICES_DEFAULT                         0x00000000UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMOREGSLICES_enable_oreg                     0x00000000UL                                                 /**< Mode enable_oreg for RAC_PATRIM3            */
#define _RAC_PATRIM3_TXTRIMOREGSLICES_not_valid1                      0x00000001UL                                                 /**< Mode not_valid1 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXTRIMOREGSLICES_not_valid2                      0x00000002UL                                                 /**< Mode not_valid2 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXTRIMOREGSLICES_not_valid3                      0x00000003UL                                                 /**< Mode not_valid3 for RAC_PATRIM3             */
#define RAC_PATRIM3_TXTRIMOREGSLICES_DEFAULT                          (_RAC_PATRIM3_TXTRIMOREGSLICES_DEFAULT << 25)                /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMOREGSLICES_enable_oreg                      (_RAC_PATRIM3_TXTRIMOREGSLICES_enable_oreg << 25)            /**< Shifted mode enable_oreg for RAC_PATRIM3    */
#define RAC_PATRIM3_TXTRIMOREGSLICES_not_valid1                       (_RAC_PATRIM3_TXTRIMOREGSLICES_not_valid1 << 25)             /**< Shifted mode not_valid1 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXTRIMOREGSLICES_not_valid2                       (_RAC_PATRIM3_TXTRIMOREGSLICES_not_valid2 << 25)             /**< Shifted mode not_valid2 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXTRIMOREGSLICES_not_valid3                       (_RAC_PATRIM3_TXTRIMOREGSLICES_not_valid3 << 25)             /**< Shifted mode not_valid3 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXTRIMDREGMOREBW                                  (0x1UL << 27)                                                /**< TXTRIMDREGMOREBW                            */
#define _RAC_PATRIM3_TXTRIMDREGMOREBW_SHIFT                           27                                                           /**< Shift value for RAC_TXTRIMDREGMOREBW        */
#define _RAC_PATRIM3_TXTRIMDREGMOREBW_MASK                            0x8000000UL                                                  /**< Bit mask for RAC_TXTRIMDREGMOREBW           */
#define _RAC_PATRIM3_TXTRIMDREGMOREBW_DEFAULT                         0x00000000UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMDREGMOREBW_disable_extra_bw                0x00000000UL                                                 /**< Mode disable_extra_bw for RAC_PATRIM3       */
#define _RAC_PATRIM3_TXTRIMDREGMOREBW_enable_extra_bw                 0x00000001UL                                                 /**< Mode enable_extra_bw for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREGMOREBW_DEFAULT                          (_RAC_PATRIM3_TXTRIMDREGMOREBW_DEFAULT << 27)                /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREGMOREBW_disable_extra_bw                 (_RAC_PATRIM3_TXTRIMDREGMOREBW_disable_extra_bw << 27)       /**< Shifted mode disable_extra_bw for RAC_PATRIM3*/
#define RAC_PATRIM3_TXTRIMDREGMOREBW_enable_extra_bw                  (_RAC_PATRIM3_TXTRIMDREGMOREBW_enable_extra_bw << 27)        /**< Shifted mode enable_extra_bw for RAC_PATRIM3*/
#define RAC_PATRIM3_TXTRIMOREGMOREBW                                  (0x1UL << 28)                                                /**< TXTRIMOREGMOREBW                            */
#define _RAC_PATRIM3_TXTRIMOREGMOREBW_SHIFT                           28                                                           /**< Shift value for RAC_TXTRIMOREGMOREBW        */
#define _RAC_PATRIM3_TXTRIMOREGMOREBW_MASK                            0x10000000UL                                                 /**< Bit mask for RAC_TXTRIMOREGMOREBW           */
#define _RAC_PATRIM3_TXTRIMOREGMOREBW_DEFAULT                         0x00000000UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMOREGMOREBW_disable                         0x00000000UL                                                 /**< Mode disable for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMOREGMOREBW_enable                          0x00000001UL                                                 /**< Mode enable for RAC_PATRIM3                 */
#define RAC_PATRIM3_TXTRIMOREGMOREBW_DEFAULT                          (_RAC_PATRIM3_TXTRIMOREGMOREBW_DEFAULT << 28)                /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMOREGMOREBW_disable                          (_RAC_PATRIM3_TXTRIMOREGMOREBW_disable << 28)                /**< Shifted mode disable for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMOREGMOREBW_enable                           (_RAC_PATRIM3_TXTRIMOREGMOREBW_enable << 28)                 /**< Shifted mode enable for RAC_PATRIM3         */

