SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_rac.h
/* Bit fields for RAC PATRIM4 */
#define _RAC_PATRIM4_RESETVALUE                                       0x00FC0075UL                                           /**< Default value for RAC_PATRIM4               */
#define _RAC_PATRIM4_MASK                                             0x00FFFFFFUL                                           /**< Mask for RAC_PATRIM4                        */
#define _RAC_PATRIM4_TXTRIMXPAVNBDRV_SHIFT                            0                                                      /**< Shift value for RAC_TXTRIMXPAVNBDRV         */
#define _RAC_PATRIM4_TXTRIMXPAVNBDRV_MASK                             0x3UL                                                  /**< Bit mask for RAC_TXTRIMXPAVNBDRV            */
#define _RAC_PATRIM4_TXTRIMXPAVNBDRV_DEFAULT                          0x00000001UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p60                    0x00000000UL                                           /**< Mode vnb_plus_0p60 for RAC_PATRIM4          */
#define _RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p65                    0x00000001UL                                           /**< Mode vnb_plus_0p65 for RAC_PATRIM4          */
#define _RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p70                    0x00000002UL                                           /**< Mode vnb_plus_0p70 for RAC_PATRIM4          */
#define _RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p75                    0x00000003UL                                           /**< Mode vnb_plus_0p75 for RAC_PATRIM4          */
#define RAC_PATRIM4_TXTRIMXPAVNBDRV_DEFAULT                           (_RAC_PATRIM4_TXTRIMXPAVNBDRV_DEFAULT << 0)            /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p60                     (_RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p60 << 0)      /**< Shifted mode vnb_plus_0p60 for RAC_PATRIM4  */
#define RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p65                     (_RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p65 << 0)      /**< Shifted mode vnb_plus_0p65 for RAC_PATRIM4  */
#define RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p70                     (_RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p70 << 0)      /**< Shifted mode vnb_plus_0p70 for RAC_PATRIM4  */
#define RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p75                     (_RAC_PATRIM4_TXTRIMXPAVNBDRV_vnb_plus_0p75 << 0)      /**< Shifted mode vnb_plus_0p75 for RAC_PATRIM4  */
#define _RAC_PATRIM4_TXTRIMXPAVPBDRV_SHIFT                            2                                                      /**< Shift value for RAC_TXTRIMXPAVPBDRV         */
#define _RAC_PATRIM4_TXTRIMXPAVPBDRV_MASK                             0xCUL                                                  /**< Bit mask for RAC_TXTRIMXPAVPBDRV            */
#define _RAC_PATRIM4_TXTRIMXPAVPBDRV_DEFAULT                          0x00000001UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p60                    0x00000000UL                                           /**< Mode vpb_plus_0p60 for RAC_PATRIM4          */
#define _RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p65                    0x00000001UL                                           /**< Mode vpb_plus_0p65 for RAC_PATRIM4          */
#define _RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p70                    0x00000002UL                                           /**< Mode vpb_plus_0p70 for RAC_PATRIM4          */
#define _RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p75                    0x00000003UL                                           /**< Mode vpb_plus_0p75 for RAC_PATRIM4          */
#define RAC_PATRIM4_TXTRIMXPAVPBDRV_DEFAULT                           (_RAC_PATRIM4_TXTRIMXPAVPBDRV_DEFAULT << 2)            /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p60                     (_RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p60 << 2)      /**< Shifted mode vpb_plus_0p60 for RAC_PATRIM4  */
#define RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p65                     (_RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p65 << 2)      /**< Shifted mode vpb_plus_0p65 for RAC_PATRIM4  */
#define RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p70                     (_RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p70 << 2)      /**< Shifted mode vpb_plus_0p70 for RAC_PATRIM4  */
#define RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p75                     (_RAC_PATRIM4_TXTRIMXPAVPBDRV_vpb_plus_0p75 << 2)      /**< Shifted mode vpb_plus_0p75 for RAC_PATRIM4  */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_SHIFT                        4                                                      /**< Shift value for RAC_TXTRIMXPAVXSCURRENT     */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_MASK                         0xF0UL                                                 /**< Bit mask for RAC_TXTRIMXPAVXSCURRENT        */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_DEFAULT                      0x00000007UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p75db                      0x00000000UL                                           /**< Mode m1p75db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p50db                      0x00000001UL                                           /**< Mode m1p50db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p25db                      0x00000002UL                                           /**< Mode m1p25db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p00db                      0x00000003UL                                           /**< Mode m1p00db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p75db                      0x00000004UL                                           /**< Mode m0p75db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p50db                      0x00000005UL                                           /**< Mode m0p50db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p25db                      0x00000006UL                                           /**< Mode m0p25db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p00db                        0x00000007UL                                           /**< Mode p00db for RAC_PATRIM4                  */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p25db                      0x00000008UL                                           /**< Mode p0p25db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p50db                      0x00000009UL                                           /**< Mode p0p50db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p75db                      0x0000000AUL                                           /**< Mode p0p75db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p00db                      0x0000000BUL                                           /**< Mode p1p00db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p25db                      0x0000000CUL                                           /**< Mode p1p25db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p50db                      0x0000000DUL                                           /**< Mode p1p50db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p75db                      0x0000000EUL                                           /**< Mode p1p75db for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p2p00db                      0x0000000FUL                                           /**< Mode p2p00db for RAC_PATRIM4                */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_DEFAULT                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_DEFAULT << 4)        /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p75db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p75db << 4)        /**< Shifted mode m1p75db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p50db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p50db << 4)        /**< Shifted mode m1p50db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p25db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p25db << 4)        /**< Shifted mode m1p25db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p00db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m1p00db << 4)        /**< Shifted mode m1p00db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p75db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p75db << 4)        /**< Shifted mode m0p75db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p50db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p50db << 4)        /**< Shifted mode m0p50db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p25db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_m0p25db << 4)        /**< Shifted mode m0p25db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p00db                         (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p00db << 4)          /**< Shifted mode p00db for RAC_PATRIM4          */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p25db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p25db << 4)        /**< Shifted mode p0p25db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p50db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p50db << 4)        /**< Shifted mode p0p50db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p75db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p0p75db << 4)        /**< Shifted mode p0p75db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p00db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p00db << 4)        /**< Shifted mode p1p00db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p25db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p25db << 4)        /**< Shifted mode p1p25db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p50db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p50db << 4)        /**< Shifted mode p1p50db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p75db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p1p75db << 4)        /**< Shifted mode p1p75db for RAC_PATRIM4        */
#define RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p2p00db                       (_RAC_PATRIM4_TXTRIMXPAVXSCURRENT_p2p00db << 4)        /**< Shifted mode p2p00db for RAC_PATRIM4        */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_SHIFT                      8                                                      /**< Shift value for RAC_TXXPAVXSCURRENTCOARSE   */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_MASK                       0x1F00UL                                               /**< Bit mask for RAC_TXXPAVXSCURRENTCOARSE      */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_DEFAULT                    0x00000000UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep01x                     0x00000000UL                                           /**< Mode rep01x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep02x                     0x00000001UL                                           /**< Mode rep02x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep03x                     0x00000002UL                                           /**< Mode rep03x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep04x                     0x00000003UL                                           /**< Mode rep04x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep05x                     0x00000004UL                                           /**< Mode rep05x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep06x                     0x00000005UL                                           /**< Mode rep06x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep07x                     0x00000006UL                                           /**< Mode rep07x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep08x                     0x00000007UL                                           /**< Mode rep08x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep09x                     0x00000008UL                                           /**< Mode rep09x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep10x                     0x00000009UL                                           /**< Mode rep10x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep11x                     0x0000000AUL                                           /**< Mode rep11x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep12x                     0x0000000BUL                                           /**< Mode rep12x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep13x                     0x0000000CUL                                           /**< Mode rep13x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep14x                     0x0000000DUL                                           /**< Mode rep14x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep15x                     0x0000000EUL                                           /**< Mode rep15x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep16x                     0x0000000FUL                                           /**< Mode rep16x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep17x                     0x00000010UL                                           /**< Mode rep17x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep18x                     0x00000011UL                                           /**< Mode rep18x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep19x                     0x00000012UL                                           /**< Mode rep19x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep20x                     0x00000013UL                                           /**< Mode rep20x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep21x                     0x00000014UL                                           /**< Mode rep21x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep22x                     0x00000015UL                                           /**< Mode rep22x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep23x                     0x00000016UL                                           /**< Mode rep23x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep24x                     0x00000017UL                                           /**< Mode rep24x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep25x                     0x00000018UL                                           /**< Mode rep25x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep26x                     0x00000019UL                                           /**< Mode rep26x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep27x                     0x0000001AUL                                           /**< Mode rep27x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep28x                     0x0000001BUL                                           /**< Mode rep28x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep29x                     0x0000001CUL                                           /**< Mode rep29x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep30x                     0x0000001DUL                                           /**< Mode rep30x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep31x                     0x0000001EUL                                           /**< Mode rep31x for RAC_PATRIM4                 */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep32x                     0x0000001FUL                                           /**< Mode rep32x for RAC_PATRIM4                 */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_DEFAULT                     (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_DEFAULT << 8)      /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep01x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep01x << 8)       /**< Shifted mode rep01x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep02x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep02x << 8)       /**< Shifted mode rep02x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep03x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep03x << 8)       /**< Shifted mode rep03x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep04x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep04x << 8)       /**< Shifted mode rep04x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep05x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep05x << 8)       /**< Shifted mode rep05x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep06x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep06x << 8)       /**< Shifted mode rep06x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep07x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep07x << 8)       /**< Shifted mode rep07x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep08x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep08x << 8)       /**< Shifted mode rep08x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep09x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep09x << 8)       /**< Shifted mode rep09x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep10x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep10x << 8)       /**< Shifted mode rep10x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep11x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep11x << 8)       /**< Shifted mode rep11x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep12x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep12x << 8)       /**< Shifted mode rep12x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep13x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep13x << 8)       /**< Shifted mode rep13x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep14x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep14x << 8)       /**< Shifted mode rep14x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep15x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep15x << 8)       /**< Shifted mode rep15x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep16x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep16x << 8)       /**< Shifted mode rep16x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep17x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep17x << 8)       /**< Shifted mode rep17x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep18x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep18x << 8)       /**< Shifted mode rep18x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep19x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep19x << 8)       /**< Shifted mode rep19x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep20x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep20x << 8)       /**< Shifted mode rep20x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep21x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep21x << 8)       /**< Shifted mode rep21x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep22x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep22x << 8)       /**< Shifted mode rep22x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep23x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep23x << 8)       /**< Shifted mode rep23x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep24x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep24x << 8)       /**< Shifted mode rep24x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep25x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep25x << 8)       /**< Shifted mode rep25x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep26x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep26x << 8)       /**< Shifted mode rep26x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep27x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep27x << 8)       /**< Shifted mode rep27x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep28x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep28x << 8)       /**< Shifted mode rep28x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep29x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep29x << 8)       /**< Shifted mode rep29x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep30x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep30x << 8)       /**< Shifted mode rep30x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep31x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep31x << 8)       /**< Shifted mode rep31x for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep32x                      (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSE_rep32x << 8)       /**< Shifted mode rep32x for RAC_PATRIM4         */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_SHIFT                   13                                                     /**< Shift value for RAC_TXXPAVXSCURRENTCOARSEMIN*/
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_MASK                    0x6000UL                                               /**< Bit mask for RAC_TXXPAVXSCURRENTCOARSEMIN   */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_DEFAULT                 0x00000000UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin20u                 0x00000000UL                                           /**< Mode imin20u for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin10u                 0x00000001UL                                           /**< Mode imin10u for RAC_PATRIM4                */
