SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_rac.h
/* Bit fields for RAC SYLOEN */
#define _RAC_SYLOEN_RESETVALUE                                        0x00000000UL                                       /**< Default value for RAC_SYLOEN                */
#define _RAC_SYLOEN_MASK                                              0x0000039EUL                                       /**< Mask for RAC_SYLOEN                         */
#define RAC_SYLOEN_SYLODIVEN                                          (0x1UL << 1)                                       /**< SYLODIVEN                                   */
#define _RAC_SYLOEN_SYLODIVEN_SHIFT                                   1                                                  /**< Shift value for RAC_SYLODIVEN               */
#define _RAC_SYLOEN_SYLODIVEN_MASK                                    0x2UL                                              /**< Bit mask for RAC_SYLODIVEN                  */
#define _RAC_SYLOEN_SYLODIVEN_DEFAULT                                 0x00000000UL                                       /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVEN_disable                                 0x00000000UL                                       /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVEN_enable                                  0x00000001UL                                       /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVEN_DEFAULT                                  (_RAC_SYLOEN_SYLODIVEN_DEFAULT << 1)               /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVEN_disable                                  (_RAC_SYLOEN_SYLODIVEN_disable << 1)               /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVEN_enable                                   (_RAC_SYLOEN_SYLODIVEN_enable << 1)                /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVLDOBIASEN                                   (0x1UL << 2)                                       /**< SYLODIVLDOBIASEN                            */
#define _RAC_SYLOEN_SYLODIVLDOBIASEN_SHIFT                            2                                                  /**< Shift value for RAC_SYLODIVLDOBIASEN        */
#define _RAC_SYLOEN_SYLODIVLDOBIASEN_MASK                             0x4UL                                              /**< Bit mask for RAC_SYLODIVLDOBIASEN           */
#define _RAC_SYLOEN_SYLODIVLDOBIASEN_DEFAULT                          0x00000000UL                                       /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVLDOBIASEN_disable                          0x00000000UL                                       /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVLDOBIASEN_enable                           0x00000001UL                                       /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVLDOBIASEN_DEFAULT                           (_RAC_SYLOEN_SYLODIVLDOBIASEN_DEFAULT << 2)        /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVLDOBIASEN_disable                           (_RAC_SYLOEN_SYLODIVLDOBIASEN_disable << 2)        /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVLDOBIASEN_enable                            (_RAC_SYLOEN_SYLODIVLDOBIASEN_enable << 2)         /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVLDOEN                                       (0x1UL << 3)                                       /**< SYLODIVLDOEN                                */
#define _RAC_SYLOEN_SYLODIVLDOEN_SHIFT                                3                                                  /**< Shift value for RAC_SYLODIVLDOEN            */
#define _RAC_SYLOEN_SYLODIVLDOEN_MASK                                 0x8UL                                              /**< Bit mask for RAC_SYLODIVLDOEN               */
#define _RAC_SYLOEN_SYLODIVLDOEN_DEFAULT                              0x00000000UL                                       /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVLDOEN_disable                              0x00000000UL                                       /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVLDOEN_enable                               0x00000001UL                                       /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVLDOEN_DEFAULT                               (_RAC_SYLOEN_SYLODIVLDOEN_DEFAULT << 3)            /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVLDOEN_disable                               (_RAC_SYLOEN_SYLODIVLDOEN_disable << 3)            /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVLDOEN_enable                                (_RAC_SYLOEN_SYLODIVLDOEN_enable << 3)             /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN                            (0x1UL << 4)                                       /**< SYLODIVRLOSUBGRADCCLKEN                     */
#define _RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_SHIFT                     4                                                  /**< Shift value for RAC_SYLODIVRLOSUBGRADCCLKEN */
#define _RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_MASK                      0x10UL                                             /**< Bit mask for RAC_SYLODIVRLOSUBGRADCCLKEN    */
#define _RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_disable                   0x00000000UL                                       /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_enable                    0x00000001UL                                       /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_DEFAULT                    (_RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_DEFAULT << 4) /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_disable                    (_RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_disable << 4) /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_enable                     (_RAC_SYLOEN_SYLODIVRLOSUBGRADCCLKEN_enable << 4)  /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVSMUXDIVEN                                   (0x1UL << 7)                                       /**< SYLODIVSMUXDIVEN                            */
#define _RAC_SYLOEN_SYLODIVSMUXDIVEN_SHIFT                            7                                                  /**< Shift value for RAC_SYLODIVSMUXDIVEN        */
#define _RAC_SYLOEN_SYLODIVSMUXDIVEN_MASK                             0x80UL                                             /**< Bit mask for RAC_SYLODIVSMUXDIVEN           */
#define _RAC_SYLOEN_SYLODIVSMUXDIVEN_DEFAULT                          0x00000000UL                                       /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVSMUXDIVEN_disable                          0x00000000UL                                       /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVSMUXDIVEN_enable                           0x00000001UL                                       /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVSMUXDIVEN_DEFAULT                           (_RAC_SYLOEN_SYLODIVSMUXDIVEN_DEFAULT << 7)        /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVSMUXDIVEN_disable                           (_RAC_SYLOEN_SYLODIVSMUXDIVEN_disable << 7)        /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVSMUXDIVEN_enable                            (_RAC_SYLOEN_SYLODIVSMUXDIVEN_enable << 7)         /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVTLOSUBGAUXEN                                (0x1UL << 8)                                       /**< SYLODIVTLOSUBGAUXEN                         */
#define _RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_SHIFT                         8                                                  /**< Shift value for RAC_SYLODIVTLOSUBGAUXEN     */
#define _RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_MASK                          0x100UL                                            /**< Bit mask for RAC_SYLODIVTLOSUBGAUXEN        */
#define _RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_DEFAULT                       0x00000000UL                                       /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_disable                       0x00000000UL                                       /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_enable                        0x00000001UL                                       /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_DEFAULT                        (_RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_DEFAULT << 8)     /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_disable                        (_RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_disable << 8)     /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_enable                         (_RAC_SYLOEN_SYLODIVTLOSUBGAUXEN_enable << 8)      /**< Shifted mode enable for RAC_SYLOEN          */
#define RAC_SYLOEN_SYLODIVTLOSUBGEN                                   (0x1UL << 9)                                       /**< SYLODIVTLOSUBGEN                            */
#define _RAC_SYLOEN_SYLODIVTLOSUBGEN_SHIFT                            9                                                  /**< Shift value for RAC_SYLODIVTLOSUBGEN        */
#define _RAC_SYLOEN_SYLODIVTLOSUBGEN_MASK                             0x200UL                                            /**< Bit mask for RAC_SYLODIVTLOSUBGEN           */
#define _RAC_SYLOEN_SYLODIVTLOSUBGEN_DEFAULT                          0x00000000UL                                       /**< Mode DEFAULT for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLOSUBGEN_disable                          0x00000000UL                                       /**< Mode disable for RAC_SYLOEN                 */
#define _RAC_SYLOEN_SYLODIVTLOSUBGEN_enable                           0x00000001UL                                       /**< Mode enable for RAC_SYLOEN                  */
#define RAC_SYLOEN_SYLODIVTLOSUBGEN_DEFAULT                           (_RAC_SYLOEN_SYLODIVTLOSUBGEN_DEFAULT << 9)        /**< Shifted mode DEFAULT for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLOSUBGEN_disable                           (_RAC_SYLOEN_SYLODIVTLOSUBGEN_disable << 9)        /**< Shifted mode disable for RAC_SYLOEN         */
#define RAC_SYLOEN_SYLODIVTLOSUBGEN_enable                            (_RAC_SYLOEN_SYLODIVTLOSUBGEN_enable << 9)         /**< Shifted mode enable for RAC_SYLOEN          */

