SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_rac.h
/* Bit fields for RAC TXOGNDPKD */
#define _RAC_TXOGNDPKD_RESETVALUE                                     0x00000000UL                                       /**< Default value for RAC_TXOGNDPKD             */
#define _RAC_TXOGNDPKD_MASK                                           0x0000007FUL                                       /**< Mask for RAC_TXOGNDPKD                      */
#define _RAC_TXOGNDPKD_TXPKDOGNDTHRESH_SHIFT                          0                                                  /**< Shift value for RAC_TXPKDOGNDTHRESH         */
#define _RAC_TXOGNDPKD_TXPKDOGNDTHRESH_MASK                           0xFUL                                              /**< Bit mask for RAC_TXPKDOGNDTHRESH            */
#define _RAC_TXOGNDPKD_TXPKDOGNDTHRESH_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define RAC_TXOGNDPKD_TXPKDOGNDTHRESH_DEFAULT                         (_RAC_TXOGNDPKD_TXPKDOGNDTHRESH_DEFAULT << 0)      /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH                            (0x1UL << 4)                                       /**< TXPKDOGNDBYPASSLATCH                        */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_SHIFT                     4                                                  /**< Shift value for RAC_TXPKDOGNDBYPASSLATCH    */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_MASK                      0x10UL                                             /**< Bit mask for RAC_TXPKDOGNDBYPASSLATCH       */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_disable                   0x00000000UL                                       /**< Mode disable for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_enable                    0x00000001UL                                       /**< Mode enable for RAC_TXOGNDPKD               */
#define RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_DEFAULT                    (_RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_DEFAULT << 4) /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_disable                    (_RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_disable << 4) /**< Shifted mode disable for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_enable                     (_RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_enable << 4)  /**< Shifted mode enable for RAC_TXOGNDPKD       */
#define RAC_TXOGNDPKD_TXPKDOGNDTYPE                                   (0x1UL << 5)                                       /**< TXPKDOGNDTYPE                               */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_SHIFT                            5                                                  /**< Shift value for RAC_TXPKDOGNDTYPE           */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_MASK                             0x20UL                                             /**< Bit mask for RAC_TXPKDOGNDTYPE              */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_DEFAULT                          0x00000000UL                                       /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_negative                         0x00000000UL                                       /**< Mode negative for RAC_TXOGNDPKD             */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_positive                         0x00000001UL                                       /**< Mode positive for RAC_TXOGNDPKD             */
#define RAC_TXOGNDPKD_TXPKDOGNDTYPE_DEFAULT                           (_RAC_TXOGNDPKD_TXPKDOGNDTYPE_DEFAULT << 5)        /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDTYPE_negative                          (_RAC_TXOGNDPKD_TXPKDOGNDTYPE_negative << 5)       /**< Shifted mode negative for RAC_TXOGNDPKD     */
#define RAC_TXOGNDPKD_TXPKDOGNDTYPE_positive                          (_RAC_TXOGNDPKD_TXPKDOGNDTYPE_positive << 5)       /**< Shifted mode positive for RAC_TXOGNDPKD     */
#define RAC_TXOGNDPKD_TXPKDOGNDRESET                                  (0x1UL << 6)                                       /**< TXPKDOGNDRESET                              */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_SHIFT                           6                                                  /**< Shift value for RAC_TXPKDOGNDRESET          */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_MASK                            0x40UL                                             /**< Bit mask for RAC_TXPKDOGNDRESET             */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_DEFAULT                         0x00000000UL                                       /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_latch                           0x00000000UL                                       /**< Mode latch for RAC_TXOGNDPKD                */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_reset_latch                     0x00000001UL                                       /**< Mode reset_latch for RAC_TXOGNDPKD          */
#define RAC_TXOGNDPKD_TXPKDOGNDRESET_DEFAULT                          (_RAC_TXOGNDPKD_TXPKDOGNDRESET_DEFAULT << 6)       /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDRESET_latch                            (_RAC_TXOGNDPKD_TXPKDOGNDRESET_latch << 6)         /**< Shifted mode latch for RAC_TXOGNDPKD        */
#define RAC_TXOGNDPKD_TXPKDOGNDRESET_reset_latch                      (_RAC_TXOGNDPKD_TXPKDOGNDRESET_reset_latch << 6)   /**< Shifted mode reset_latch for RAC_TXOGNDPKD  */

/* Bit fields for RAC TXOGNDPKDSTATUS */
#define _RAC_TXOGNDPKDSTATUS_RESETVALUE                               0x00000001UL                                   /**< Default value for RAC_TXOGNDPKDSTATUS       */
#define _RAC_TXOGNDPKDSTATUS_MASK                                     0x00000003UL                                   /**< Mask for RAC_TXOGNDPKDSTATUS                */
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDN                                (0x1UL << 0)                                   /**< TXOGNDPKDN                                  */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_SHIFT                         0                                              /**< Shift value for RAC_TXOGNDPKDN              */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_MASK                          0x1UL                                          /**< Bit mask for RAC_TXOGNDPKDN                 */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_DEFAULT                       0x00000001UL                                   /**< Mode DEFAULT for RAC_TXOGNDPKDSTATUS        */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_triped                        0x00000000UL                                   /**< Mode triped for RAC_TXOGNDPKDSTATUS         */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_no_trip                       0x00000001UL                                   /**< Mode no_trip for RAC_TXOGNDPKDSTATUS        */
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_DEFAULT                        (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_TXOGNDPKDSTATUS*/
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_triped                         (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_triped << 0)  /**< Shifted mode triped for RAC_TXOGNDPKDSTATUS */
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_no_trip                        (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_no_trip << 0) /**< Shifted mode no_trip for RAC_TXOGNDPKDSTATUS*/
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDP                                (0x1UL << 1)                                   /**< TXOGNDPKDP                                  */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_SHIFT                         1                                              /**< Shift value for RAC_TXOGNDPKDP              */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_MASK                          0x2UL                                          /**< Bit mask for RAC_TXOGNDPKDP                 */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_DEFAULT                       0x00000000UL                                   /**< Mode DEFAULT for RAC_TXOGNDPKDSTATUS        */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_no_trip                       0x00000000UL                                   /**< Mode no_trip for RAC_TXOGNDPKDSTATUS        */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_tripped                       0x00000001UL                                   /**< Mode tripped for RAC_TXOGNDPKDSTATUS        */
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_DEFAULT                        (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_DEFAULT << 1) /**< Shifted mode DEFAULT for RAC_TXOGNDPKDSTATUS*/
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_no_trip                        (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_no_trip << 1) /**< Shifted mode no_trip for RAC_TXOGNDPKDSTATUS*/
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_tripped                        (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_tripped << 1) /**< Shifted mode tripped for RAC_TXOGNDPKDSTATUS*/

/* Bit fields for RAC SCRATCH0 */
#define _RAC_SCRATCH0_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_SCRATCH0              */
#define _RAC_SCRATCH0_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH0                       */
#define _RAC_SCRATCH0_SCRATCH0_SHIFT                                  0                                     /**< Shift value for RAC_SCRATCH0                */
#define _RAC_SCRATCH0_SCRATCH0_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH0                   */
#define _RAC_SCRATCH0_SCRATCH0_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH0               */
#define RAC_SCRATCH0_SCRATCH0_DEFAULT                                 (_RAC_SCRATCH0_SCRATCH0_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH0       */

/* Bit fields for RAC SCRATCH1 */
#define _RAC_SCRATCH1_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_SCRATCH1              */
#define _RAC_SCRATCH1_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH1                       */
#define _RAC_SCRATCH1_SCRATCH1_SHIFT                                  0                                     /**< Shift value for RAC_SCRATCH1                */
#define _RAC_SCRATCH1_SCRATCH1_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH1                   */
#define _RAC_SCRATCH1_SCRATCH1_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH1               */
#define RAC_SCRATCH1_SCRATCH1_DEFAULT                                 (_RAC_SCRATCH1_SCRATCH1_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH1       */

